// 题目：企业发放的奖金根据利润提成。

// 利润(I)低于或等于10万元时，奖金可提10%；
// 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
// 20万到40万之间时，高于20万元的部分，可提成5%；
// 40万到60万之间时高于40万元的部分，可提成3%；
// 60万到100万之间时，高于60万元的部分，可提成1.5%；
// 高于100万元时，超过100万元的部分按1%提成。
// 从键盘输入当月利润I，求应发放奖金总数？

// 程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。

#include <stdio.h>
int main(int argc, char const *argv[])
{
	double I, c1 = 10, c2 = 20, c3 = 40, c4 = 60, c5 = 100, sum = 0;
	scanf("%lf", &I);
	int l = I / 10, k = 0;
	// switch (l)
	// {
	// case k=10:
	// case
	// 	m = I - k * 10;
	// 	I = I - m;
	// 	m = m * 0.01;
	// 	n = n + m;
	// case k=6:
	// 	m = I - k * 10;
	// 	I = I - m;
	// 	m = m * 0.03;
	// 	n = n + m;
	// case k=4:
	// 	m = I - k * 10;
	// 	I = I - m;
	// 	m = m * 0.05;
	// 	n = n + m;
	// case k=2:
	// 	m = I - k * 10;
	// 	I = I - m;
	// 	m = m * 0.075;
	// 	n = n + m;
	// case k=1:
	// 	m = I - k * 10;
	// 	I = I - m;
	// 	m = m * 0.1;
	// 	n = n + m;
	// 	break;

	// default:
	// I = I
	// 	break;
	// }
	printf("I=%f\n",I);
	if (I >= 100)
	{
		sum = (I - c5) * 0.01 + (c5 - c4) * 0.015 + (c4 - c3) * 0.03 + (c3 - c2) * 0.05 + (c2 - c1) * 0.075 + c1 * 0.1;
	}
	else
	{
		if (I >= 60)
		{
			sum = (I - c4) * 0.015 + (c4 - c3) * 0.03 + (c3 - c2) * 0.05 + (c2 - c1) * 0.075 + c1 * 0.1;
		}
		else
		{
			if (I >= 40)
			{
				sum = (I - c3) * 0.03 + (c3 - c2) * 0.05 + (c2 - c1) * 0.075 + c1 * 0.1;
			}
			else
			{
				if (I >= 20)
				{
					sum = (I - c2) * 0.05 + (c2 - c1) * 0.075 + c1 * 0.1;
				}
				else
				{
					if (I >= 10)
					{
						sum = (I - c1) * 0.075 + c1 * 0.1;
					}
					else
					{
						if (I <= 10)
						{
							sum = I * 0.1;
						}
					}
				}
			}
		}
	}

printf("%f\n",sum);
	return 0;
}